#+TITLE:     Best Practices for Reproducible Research
#+AUTHOR:    Arnaud Legrand, Luka Stanisic
#+DATE: PUF/JLPC Summer School, Sophia, June 2014
#+startup: beamer
#+STARTUP: overview
#+STARTUP: indent
#+TAGS: noexport(n)
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [11pt,xcolor=dvipsnames,presentation]
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+LATEX_HEADER: \usedescriptionitemofwidthas{bl}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage{ifthen,figlatex,amsmath,amstext,gensymb,amssymb}
#+LATEX_HEADER: \usepackage{boxedminipage,xspace,multicol}
#+LATEX_HEADER: \usetheme{Madrid}
#+LATEX_HEADER: \usecolortheme[named=BrickRed]{structure}
#+LATEX_HEADER: \setbeamertemplate{footline}[frame number]
#+LATEX_HEADER: \setbeamertemplate{navigation symbols}{}
#+LATEX_HEADER: \usepackage{verbments}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{url} \urlstyle{sf}
#+LATEX_HEADER: \usepackage[american]{babel}

#+LATEX_HEADER: \let\alert=\structure % to make sure the org * * works

#+LATEX_HEADER: \usepackage{pdfpages}
#+LATEX_HEADER: \makeatletter
#+LATEX_HEADER: \gdef\fsvtpage{\ps@navigation\refstepcounter{framenumber}}%
#+LATEX_HEADER: \makeatother
#+LATEX_HEADER: \setbeamercolor{background canvas}{bg=}



#+BEGIN_LaTeX
\definecolor{keywords}{RGB}{255,0,90}
\definecolor{comments}{RGB}{60,179,113}
\definecolor{fore}{RGB}{249,242,215}
\definecolor{back}{RGB}{51,51,51}
\newcommand{\accolade}[1]{$\left\{\begin{array}{c}\vspace{#1}\end{array}\right.$}
%\lstset{
%  basicstyle=\color{fore},
%  keywordstyle=\color{keywords},
%  commentstyle=\color{comments},
%  backgroundcolor=\color{back}
%}
#+END_LaTeX

#+BEGIN_LaTeX
\newcommand{\restorefootline}{\setbeamertemplate{navigation symbols}{}}
\newcommand{\setfootline}[1]{\setbeamertemplate{navigation symbols}{\textcolor{black}{\textbf{#1}}}}
\newcommand{\includeslides}[3]{%
*** Data frames
\small
#+begin_src R :results output :session :exports none
library(ggplot2)
library(plyr)
#+end_src
A data frame is a data tables (with columns and rows). =mtcars= is a
built-in data frame that we will use in the sequel
#+BEGIN_SRC R :results output :exports both :session
head(mtcars);
#+END_SRC

#+RESULTS:
:                    mpg cyl disp  hp drat    wt  qsec vs am gear carb
: Mazda RX4         21.0   6  160 110 3.90 2.620 16.46  0  1    4    4
: Mazda RX4 Wag     21.0   6  160 110 3.90 2.875 17.02  0  1    4    4
: Datsun 710        22.8   4  108  93 3.85 2.320 18.61  1  1    4    1
: Hornet 4 Drive    21.4   6  258 110 3.08 3.215 19.44  1  0    3    1
: Hornet Sportabout 18.7   8  360 175 3.15 3.440 17.02  0  0    3    2
: Valiant           18.1   6  225 105 2.76 3.460 20.22  1  0    3    1

You can also load a data frame from a CSV file:
#+BEGIN_SRC R :results output :exports both :session
df <- read.csv("http://foo.org/mydata.csv", header=T, 
               strip.white=TRUE);
#+END_SRC
You will *get help* by using =?=:
#+BEGIN_SRC :results output :exports both :session
?data.frame
?rbind
?cbind
#+END_SRC
*** Exploring Content (1)
\small
#+BEGIN_SRC R :results output :exports both :session
names(mtcars);
#+END_SRC

#+RESULTS:
:  [1] "mpg"  "cyl"  "disp" "hp"   "drat" "wt"   "qsec" "vs"   "am"   "gear"
: [11] "carb"

#+BEGIN_SRC R :results output :exports both :session
str(mtcars);
#+END_SRC

#+RESULTS:
#+begin_example
'data.frame':	32 obs. of  11 variables:
 $ mpg : num  21 21 22.8 21.4 18.7 18.1 14.3 24.4 22.8 19.2 ...
 $ cyl : num  6 6 4 6 8 6 8 4 4 6 ...
 $ disp: num  160 160 108 258 360 ...
 $ hp  : num  110 110 93 110 175 105 245 62 95 123 ...
 $ drat: num  3.9 3.9 3.85 3.08 3.15 2.76 3.21 3.69 3.92 3.92 ...
 $ wt  : num  2.62 2.88 2.32 3.21 3.44 ...
 $ qsec: num  16.5 17 18.6 19.4 17 ...
 $ vs  : num  0 0 1 1 0 1 0 1 1 1 ...
 $ am  : num  1 1 1 0 0 0 0 0 0 0 ...
 $ gear: num  4 4 4 3 3 3 3 4 4 4 ...
 $ carb: num  4 4 1 1 2 1 4 2 2 4 ...
#+end_example
*** Exploring Content (2)
\small
#+BEGIN_SRC R :results output :exports both :session
dim(mtcars);
length(mtcars);
#+END_SRC

#+RESULTS:
: [1] 32 11
: [1] 11

#+BEGIN_SRC R :results output :exports both :session
summary(mtcars);
#+END_SRC

#+RESULTS:
#+begin_example
      mpg             cyl             disp             hp       
 Min.   :10.40   Min.   :4.000   Min.   : 71.1   Min.   : 52.0  
 1st Qu.:15.43   1st Qu.:4.000   1st Qu.:120.8   1st Qu.: 96.5  
 Median :19.20   Median :6.000   Median :196.3   Median :123.0  
 Mean   :20.09   Mean   :6.188   Mean   :230.7   Mean   :146.7  
 3rd Qu.:22.80   3rd Qu.:8.000   3rd Qu.:326.0   3rd Qu.:180.0  
 Max.   :33.90   Max.   :8.000   Max.   :472.0   Max.   :335.0  
      drat             wt             qsec             vs        
 Min.   :2.760   Min.   :1.513   Min.   :14.50   Min.   :0.0000  
 1st Qu.:3.080   1st Qu.:2.581   1st Qu.:16.89   1st Qu.:0.0000  
 Median :3.695   Median :3.325   Median :17.71   Median :0.0000  
 Mean   :3.597   Mean   :3.217   Mean   :17.85   Mean   :0.4375  
 3rd Qu.:3.920   3rd Qu.:3.610   3rd Qu.:18.90   3rd Qu.:1.0000  
 Max.   :4.930   Max.   :5.424   Max.   :22.90   Max.   :1.0000  
       am              gear            carb      
 Min.   :0.0000   Min.   :3.000   Min.   :1.000  
 1st Qu.:0.0000   1st Qu.:3.000   1st Qu.:2.000  
 Median :0.0000   Median :4.000   Median :2.000  
 Mean   :0.4062   Mean   :3.688   Mean   :2.812  
 3rd Qu.:1.0000   3rd Qu.:4.000   3rd Qu.:4.000  
 Max.   :1.0000   Max.   :5.000   Max.   :8.000
#+end_example
*** Accessing Content
\small
#+BEGIN_SRC R :results output :exports both :session
mtcars$mpg
#+END_SRC

#+RESULTS:
:  [1] 21.0 21.0 22.8 21.4 18.7 18.1 14.3 24.4 22.8 19.2 17.8 16.4 17.3 15.2 10.4
: [16] 10.4 14.7 32.4 30.4 33.9 21.5 15.5 15.2 13.3 19.2 27.3 26.0 30.4 15.8 19.7
: [31] 15.0 21.4

#+BEGIN_SRC R :results output :exports both :session
mtcars[2:5,]$mpg
#+END_SRC

#+RESULTS:
: [1] 21.0 22.8 21.4 18.7

#+BEGIN_SRC R :results output :exports both :session
mtcars[mtcars$mpg == 21.0,]
#+END_SRC

#+RESULTS:
:               mpg cyl disp  hp drat    wt  qsec vs am gear carb
: Mazda RX4      21   6  160 110  3.9 2.620 16.46  0  1    4    4
: Mazda RX4 Wag  21   6  160 110  3.9 2.875 17.02  0  1    4    4

#+BEGIN_SRC R :results output :exports both :session
mtcars[mtcars$mpg == 21.0 & mtcars$wt > 2.7,]
#+END_SRC

#+RESULTS:
:               mpg cyl disp  hp drat    wt  qsec vs am gear carb
: Mazda RX4 Wag  21   6  160 110  3.9 2.875 17.02  0  1    4    4
*** Extending Content
\small
#+BEGIN_SRC R :results output :exports both :session
mtcars$cost = log(mtcars$hp)*atan(mtcars$disp)/
                 sqrt(mtcars$gear**5);
mean(mtcars$cost);
summary(mtcars$cost);
#+END_SRC

#+RESULTS:
: [1] 0.345994
:    Min. 1st Qu.  Median    Mean 3rd Qu.    Max. 
:  0.1261  0.2038  0.2353  0.3460  0.5202  0.5534

#+BEGIN_SRC R :results output graphics :file ./mtcars_hist.pdf :exports both :session
hist(mtcars$cost,breaks=20);
#+END_SRC

#+ATTR_LaTeX: :height 4.5cm
#+RESULTS:
[[file:./mtcars_hist.pdf]]

*** plyr: Powerfull One-liners
\small
#+BEGIN_SRC R :results output :exports both :session
library(plyr)
mtcars_summarized = ddply(mtcars,c("cyl","carb"), summarize, 
      num = length(wt), wt_mean = mean(wt), wt_sd = sd(wt),
      qsec_mean = mean(qsec), qsec_sd = sd(qsec));
mtcars_summarized
#+END_SRC

#+RESULTS:
#+begin_example
  cyl carb num  wt_mean     wt_sd qsec_mean   qsec_sd
1   4    1   5 2.151000 0.2627118  19.37800 0.6121029
2   4    2   6 2.398000 0.7485412  18.93667 2.2924368
3   6    1   2 3.337500 0.1732412  19.83000 0.5515433
4   6    4   4 3.093750 0.4131460  17.67000 1.1249296
5   6    6   1 2.770000        NA  15.50000        NA
6   8    2   4 3.560000 0.1939502  17.06000 0.1783255
7   8    3   3 3.860000 0.1835756  17.66667 0.3055050
8   8    4   6 4.433167 1.0171431  16.49500 1.4424112
9   8    8   1 3.570000        NA  14.60000        NA
#+end_example
If your data is not in the right form *give a try to =reshapeP/melt=*.

#+BEGIN_CENTER
  #+LaTeX: {\bf plyr next generation = dplyr}
#+END_CENTER
